[
    {
        "id" : 191,
        "name" : "API Security: Anatomy of A Real API Attack (And How To Defend Against It)",
        "description" : "In the Fall of 2013, many users of the social post scheduling/management service Buffer woke up one morning to find that unauthorized posts had been made on their behalf to their Twitter and Facebook accounts. To the untrained eye, it appeared as though their Twitter and Facebook accounts had been hacked and that usernames and passwords were compromised. But the transgression was far more layered and sophisticated, involving the theft of OAuth tokens, the penetration of cloud-based databases and code-repositories, and a massive breach of API security. To date, the extent of the damage and the intentions of the perpetrators is still not fully known (but we have educated guesses). The anatomy of this attack revealed how multiple vulnerabilities can combine to produce risk for which no silver bullet exists. In this session, we hear from some of the key players involved in the attack, what was learned about strengthening API security, where weaknesses still exist in the infrastructure, and measures that all public API and service providers must take to secure their businesses and the Internet. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Sunil Sadasivan, John Bradley, Adam Dawes"
    },
    {
        "id" : 201,
        "name" : "Transforming Businesses And Industries into Platforms",
        "description" : "One of Marc Andreessen's key subtexts to his thesis that software is eating the world is that businesses as well as entire industries have to rethink themselves as platforms. If you haven't started to rethink your business as industry as a platform, there's no time like the present to get started. Because if you don't, then a highly disruptive startup will come along and do it for you (and we've seen this movie a few times already!). What's the moral of the story? Figure out how to 'platformize' your own business or risk irrelevance. In this panel discussion, APIcon has recruited thought-leading panelists from various industries to share their insights into how they've rethought businesses or entire industries as a platform and then went and did something about it.",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Joshua Greenough, John Collison, Bobby Napiltonia, Patrick McGrath"
    },
    {
        "id" : 211,
        "name" : "An Innovation Agenda For The API Economy",
        "description" : "APIs are truly coming into their own: there's a very real and rapidly growing API economy, a rich ecosystem, robust usecases and business models and transformative examples, urgency and funding, enterprise and consumer plays, tons of press, and of course already-huge mobile and soon-to-be-huge internet-of-things. But peel back the covers and you'll discover there are more unsolved problems than baked solutions, more opportunities to innovate than mature offerings. We'll discuss these largely-unsettled frontiers, maybe generate a bit of controversy, and challenge you to stake your claim to fame. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Uri Sarid"
    },
    {
        "id" : 221,
        "name" : "Beyond REST: Modern REST Alternatives and Why They Matter",
        "description" : "It's hard to get through any conversation about APIs without the terms 'REST' or 'RESTful' coming up. It's as though RESTfullness is the Holy Grail of APIs and discussion of any other approach is blasphemous. But the truth is that there is life beyond REST. In this session, you'll hear about life beyond REST. What else is out there and when does it make sense to consider alternatives. For example, should you pursue more of an SDK driven strategy and to what extent should those SDKs insulate developers from the specifics and protocols of your API? Plenty of major API providers still stick by SOAP and XML. Are they still viable? These and other questions will be answered by a panel of experts with first hand knowledge of the alternatives because they live, eat, and breathe them every day. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Jason Terk, Randy Abernathy, Jason Harmon "
    },
    {
        "id" : 231,
        "name" : "Project MyUSA: Enabling user control of data while maximizing privacy",
        "description" : "Project MyUSA was an inaugural Presidential Innovation Fellowship project sponsored by the White House and GSA. The aim of the project was to re-imagine how citizens interact with government online. As part of the project, the team prototyped a platform for citizen-centric, API-driven applications that put the user in control of the data the government held on their behalf, while at the same time maximizing security and privacy of that data. Key technologies involved include OAuth and RESTful APIs. This talk provides an overview of the vision Project MyUSA sets for government services, and details how other organizations can utilize these ideas in other scenarios. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Greg Gershman"
    },
    {
        "id" : 241,
        "name" : "XMPP - Normalize Internet Of Things",
        "description" : "Internet Of Things is not about one single protocol or technology; it is about making them live together. The IoT XMPP initiative is about using a well-known technology that once unified humans to communicate on the Internet, to now give the same advantage for connected things. With XMPP you can normalize every other protocol, like MQTT, CoAP, RESTful, etc. into one common language. No more proprietary Back-End or API when you create the next IoT solution. You will find out how XMPP helps you navigate as a pro in the protocol jungle. Every domain has its own protocol war, but to rule real-time communication on the Internet there is only one, and that is XMPP. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Rikard Strid"
    },
    {
        "id" : 251,
        "name" : "Developing for the Internet of Things",
        "description" : "The Internet of Things is coming, and open source developer tools and frameworks are starting to take shape to support it. At Eclipse there is a vibrant community working on the protocols, runtimes, frameworks and tools for building IoT applications in languages such as Lua, JavaScript and Java. In this talk, Eclipse Foundation executive director Mike Milinkovich will be discussing some of these projects such as Paho (MQTT client), Mosquitto (MQTT broker), Kura (Java+OSGi device gateway framework), and others. In addition, he will be using the Orion web-based development tool to demonstrate how you can use your browser to develop IoT applications right on your favorite open hardware device, whether it be a Raspberry Pi, Beagle Bone, or Arduino. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Mike Milinkovich"
    },
    {
        "id" : 261,
        "name" : "Nothin' But API: When Your API Is The Business",
        "description" : "Who woulda thunk it? In the spirit of transforming businesses and even entire industries into platforms (see our other session on that), APIs have become so powerful at abstracting complexity that they have given rise to a class of startup whose only public facing product is an API. In this panel discussion, we gather executives from a handful of companies that have been down the API-only path to learn from them what their motivations were for starting an API-only company, how it has been going, what has worked and what hasn't, and what the founders of other companies looking to go down the same path should be thinking about. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Stephan Schirrecker, Tony Falco, Cristina Cordova"
    },
    {
        "id" : 271,
        "name" : "Getting Funded: What VC Want To Hear From API and Platform-Driven Startups",
        "description" : "Last year, ReadWrite published a story whose headline said A Company Without APIs is Like a Computer Without Internet. And of course, there's Marc Andreessen's thesis about software eating the world and how not just businesses, but entire industries have to rethink themselves as platforms. But what's the VC point of view? In this panel we'll talk about the role that platformization and APIs play in the conversation between venture capitalists and founders? Are APIs, as ReadWrite says, a must have? Is it a checklist item for VCs today before investment will be considered. Do VC look for a platform play that will appeal to developers? And how do VCs view the API economy as an investment opportunity? For startups and founders that have rounds of investment on their roadmap, this is a must attend session to understand how to prepare for those all-important venture capital conversations. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Jeff Clavier, Reza Kazemipour, Ullas Naik, Ethan Kurzweil"
    },
    {
        "id" : 281,
        "name" : "Building A Mobile First API When You're Not Mobile First",
        "description" : "Developers everywhere are learning why mobile APIs need to be different. Based on lessons learned at Klout and Lithium designing, adapting, and scaling APIs for consumer and enterprise mobile applications, this session will explore how to take a core API and adapt it for your apps. By exploring classic n-tier and thin client architecture, we will explore why pure REST may not be best. This talk continues by examining the tradeoffs when building mobile APIs and applications, including a dive into the advantages of API management, supporting a third-party mobile ecosystem, and the challenges of consumer versus enterprise apps. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Tyler Singletary"
    },
    {
        "id" : 291,
        "name" : "Is there an API in that (IoT)?",
        "description" : "An opinionated investigation into the impact of the Internet of Thing on APIs. What will remain and what will change? How will the future API design, protocols and developer experience be impacted by the promises and limitations of IoT. If you are wondering if IoT is hype or reality and how you will integrate it with it from an API perspective this talk is for you. This presentation will get you an (admittedly) opinionated overview over the current state of the art and possible future direction of APIs in IoT.",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Holger Reinhardt"
    },
    {
        "id" : 301,
        "name" : "An Internet of Things? Not So Fast.",
        "description" : "Is the Internet of Things really here? How will we know? More and more things around us have sensors that passively collects information about people and activities, then this data is used by our apps on smartphones and tablets. Yet these things around us don't yet feel like they are making a big impact. The challenge is all these things are still unconnected. You need to integrate the applications, data, clouds, APIs, supply chains and partner ecosystems that make it possible for start ups and enterprises to deliver new business and consumer value. This talk examines what's needed for a true IoT and the first steps needed to unleash new possibilities for forward-looking organizations on the road to transformation'and a true IoT. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Ross Mason"
    },
    {
        "id" : 311,
        "name" : "Optimizing, Testing, and Preparing APIs For Massive Scale",
        "description" : "Netflix has a unique set of challenges when it comes to APIs. The Netflix API supports more than 1,000 different device types, handles billions of requests per day, and is the infrastructure that supports nearly 33% of the North American downstream Internet traffic. APIs at this scale require different design patterns, although these same patterns can provide great value to organizations at much smaller scale as well. In this session, Netflix vice president of edge engineering Daniel Jacobson will talk about various design principles and implementations that are used for the Netflix API, as well as techniques for scaling, testing and deploying the system.",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Daniel Jacobson"
    },
    {
        "id" : 321,
        "name" : "How Ubiquitous Internet and Open APIs Transform Public Service",
        "description" : "Increasingly ubiquitous internet access means that services that historically had to be done by a government agency can now be done by the public, public-private partnerships, or shared ventures across government agencies. APIs if done right can enable the sharing of both open modular code and open data across groups for improved local, national, and global public service. This discussion will provide a CIO-level perspective on the public service transformation that is accelerating -- and highlight how the internet and open APIs enable \"We The People\" to achieve community goals to improve our world.",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "David Bray"
    },
    {
        "id" : 331,
        "name" : "APIs That Work Like the Web",
        "description" : "We've all heard the mantra that an API-centric approach can turn your product into a platform, but what if you really want to scale an ecosystem beyond the limits of a single product or service? What if you want to compete with an incumbent that has its customers locked in? Thinking of your API as part of a distributed network with a diverse range of implementations is one way to dramatically broaden your reach. The web itself is the most classic distributed API, but most modern APIs built on top of the web are bespoke centralized systems. This talk will explore examples where standardized APIs are used to build distributed networks with rich ecosystems of products and services that all work together. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Philip Ashlock"
    },
    {
        "id" : 341,
        "name" : "How Two Netflix Engineers Built 150 Popular Web Services In Five Months With Zero Downtime",
        "description" : "Netflix's REST API server project was a big success, resulting in 150 web services in five months and no downtime. By taking advantage of self-documenting API frameworks, continuous integration with JSON-friendly API tests and automated deployments, we Netflix was able to focus on building services that would publicize themselves. This session highlights the engineering tools and processes that enable rapid API development, deployment and adoption. Netflix engineers will cover the Scalatra, Swagger, and ScalaTest frameworks as well as Netflix's push-button deployment system using Jenkins and Asgard.",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Jason Swartz"
    },
    {
        "id" : 351,
        "name" : "From Idea to API in Half a Day",
        "description" : "Want to excel at agile API design? In this 2 hour workshop you will learn how to collaboratively design an API from scratch for great user experience. You will learn how to iterate with your users, using their feedback to help you get your API right from the start. But we won't stop there, we will show you the whole life cycle of how to build, deploy and manage your API with RAML. All within 2 hours. Don't miss this opportunity to make your API shine!",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Dave Nielsen, Gopi Soundarrajan, Eric Price"
    },
    {
        "id" : 361,
        "name" : "API Antipatterns: How To Identify Them. How To Avoid Them.",
        "description" : "APIs have become a part of the product ecosystem - and help the businesses by extending their developer base, and offering seamless i ntegration with other services or products. Sometimes, the APIs themselves are the product. However, with so many APIs around, patterns emerge. Patterns are repeatable, reusable solutions to commonly occurring problems. Where there are patterns, there are also antipatterns. While APIs are not a new paradigm - there are no set standards or specifications formed by a committees or governing bodies for APIs. On top of this, the APIs are often built at various stages of the product, and have a good chance of being disjoint as more are added. In this talk Netflix engineers will discuss various antipatterns that creep into the API design and implementation, and how to identify and avoid them. They will also share their experiences with building APIs. While the antipatterns do not pose as big a functional challenge, they can and do impact integration efforts, scalability and performance among other things. After this session, you should be able to get familiar with the best practices around solving the most common patterns, and make your engineers and API consumers happy!",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Manish Pandit"
    },
    {
        "id" : 371,
        "name" : "Designing APIs With Apache Thrift",
        "description" : "The Apache Thrift IDL is at the heart of the Apache Thrift framework and one of its most powerful features is its ability to evolve incrementally without impairing compatibility with existing systems. The ability to take small incremental risks at the API level plays squarely into the business processes centered around continuous integration and continuous delivery. In this session attendees will gain experience with the mechanics of Apache Thrift and learn how to build RPC clients and servers for cross language/platform communications. The session also explores some of the more challenging general problems associated with interface evolution and distributed application development. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Randy Abernethy "
    },
    {
        "id" : 381,
        "name" : "Stop Reinventing the Wheel: Use Linked Data to Build Better APIs",
        "description" : "The number of Web APIs has been growing exponentially in the past few years and most current apps couldn't exist without them. Yet, the creation of APIs is still more an art than a science. It is time to stop reinventing the wheel and to start using standardized technologies in order to create APIs that are interoperable and accessible by generic clients. This session will not only introduce you to the basic concepts of Linked Data, but also show you how easy it is to build completely self-descriptive, hypermedia-driven Web APIs with technologies such as JSON-LD, Hydra, and Schema.org. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Markus Lanthaler"
    },
    {
        "id" : 391,
        "name" : "Top 5 Ways to Increase API Adoption",
        "description" : "For a public API, adoption is key. Finding the right developers can be resource-intensive. Few companies can afford to blanket the web and every conference in advertising. Even if you could, the results might not be nearly as good as the time-tested methods covered in this presentation. API veteran Adam DuVander analyzed thousands of providers to come up with five (or six) categories of strategies to increase adoption. From grassroots to traditional, to be successful most providers will likely want to take multiple approaches to growing their APIs. A community approach can pay dividends if you have the resources. Yet some may take a sales- or partnership-based approach. Almost everyone should be creating the right kind of description that speaks to developers. And the open source approach is highly scalable when done authentically. Throughout this talk DuVander shares real stories and tactics behind the strategies, plus the one method with nearly 100% success rate.",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Adam DuVander"
    },
    {
        "id" : 401,
        "name" : "10 Reasons Why Developers Hate Your API (and what to do about it)",
        "description" : "APIs are everywhere today and can be a great building block of modern applications. But all too often APIs are not truly great. Rather than love your API, developers curse it. How can you avoid that fate? In this session we'll look at the most common mistakes API providers make and you can avoid making them too. Do you offer a bad developer experience (DX)? Poor, inconsistent API design? Unreliable services? This talk is a deep dive on not just what to avoid but what to do instead. And you'll leave knowing how to get developers to love your API, not hate it. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "John Musser"
    },
    {
        "id" : 411,
        "name" : "How To Version Your API Without Losing Developer Traction",
        "description" : "This talk will discuss various techniques available to API designers around versioning and some merits and drawbacks of each. We'll do a deep dive into how Foursquare deals with versioning its API and the lessons we've learned from this. Will you find a definitive answer to \"what versioning technique should I use?\" Will you agree with much of Foursquare's decisions here? Will you meet your soulmate? Maybe, maybe, and hopefully! ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "David Hu"
    },
    {
        "id" : 421,
        "name" : "RAML: A Design-First Approach to APIs",
        "description" : "We all know that in today's connected world it's critical to unlock data and functionality from our systems, and that APIs are a good approach -- but how do we optimize for their success and adoption? In brief, we need to make sure that our APIs are useful, they are easily understood, and they provide fast time-to-value. In this workshop we will discuss how to accomplish this using a design-first approach, specifically with RAML, the RESTful API Modeling Language. We'll design a new API from the ground up with a focus on usability, mock that API, and show how to use an API Console and interactive API Notebooks to generate early user feedback. We'll also discuss how to use these tools and others to enable the long-term success of your APIs, whether you go design-first or already have them in production APIcon will also be offering workshops for the two primary alternatives to RAML; Blueprint and Swagger. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Dillon Compton"
    },
    {
        "id" : 431,
        "name" : "Connecting API Consumers with Swagger",
        "description" : "Consumers of APIs want to connect to services in the language of their choice, with techniques that fit their development process. There is no one-size-fits-all solution to connecting clients, and speed + simplicity wins. In this workshop, we will discuss how to connect developers quickly to your API with Swagger. Specifically for an existing API, we will generate a Swagger description and generate client libraries in Javascript, Java and Objective-C, as well as create interactive documentation. APIcon will also be offering workshops for the two primary alternatives to Swagger; Blueprint and RAML. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Tony Tam"
    },
    {
        "id" : 441,
        "name" : "Managing The Full API Lifecycle with API Blueprint",
        "description" : "API Blueprint is a human-friendly API description format based on Markdown that has gained wide popularity. In this talk, we're going start with basics and motivation for the Blueprint design, and review a toolchain that helps you manage your whole API lifecycle, from prototyping, design, through development, testing and beyond. APIcon will also be offering workshops for the two primary alternatives to Blueprint; RAML and Swagger. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Jakub Nesetril "
    },
    {
        "id" : 451,
        "name" : "Goodbye Eclipse, I've Gone Web",
        "description" : "The case for web-based development tools is compelling, and the next few years is going to see a massive migration away from desktop IDEs. Everybody knows that, right? The reality is going to be a lot more complicated, as the 30 years or more of investment in desktop tools is going to not be replaced overnight. Worse, at the moment the choice is largely binary. If you switch to cloud-based tools you have to leave your desktop tools behind. At the Eclipse Foundation, there are several interesting projects that are working on addressing these issues. In addition to the famous Eclipse IDE that everyone knows and {loves|hates}, the Orion project is building a completely new web-based tooling platform. The Flux project is working on bridging the gap between those two worlds. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Mike Milinkovich"
    },
    {
        "id" : 461,
        "name" : "Rules For Success When Developing for Cameras",
        "description" : "Over $100m worth of camera related projects fail every year, most are never heard about. Cameras present developers with a unique set of problems. In this talk, you'll hear about the stories of failure and success when it comes to working with live video feeds. The talk will be of interest to the general developer but also to those working in the field of Internet of Things and Business Process Automation. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Marco Herbst"
    },
    {
        "id" : 471,
        "name" : "How to Consume APIs Using Python",
        "description" : "Excited about the incredible array of APIs but don't know how to use them? Although APIs serve many purposes, there are common approaches to consuming them that you will learn in this workshop. We will survey the many types of available APIs while concentrating on a few important examples of them. In this workshop, we will use Python, a commonly used and powerful language for working with APIs. Even if you don't know Python, you'll pick up some basic concepts that will serve you well on your journey of API consumption. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Raymond Yee"
    },
    {
        "id" : 481,
        "name" : "Apache Avro, a Brief Introduction",
        "description" : "This talk will introduce you to Apache Avro. Apache Avro is a data serialization system used throughout the Apache Hadoop ecosystem and in numerous other projects, providing a persistent data format as well as a means to achieve cross language RPC. Unlike many serialization frameworks, Apache Avro embeds the data schema within the serialization stream, giving it unique flexibility with dynamically typed languages. This talk will give you a firm understanding of Apache Avro architecture and operation through demos, discussion and code walk throughs. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Randy Abernethy"
    },
    {
        "id" : 491,
        "name" : "Real-World Functional Programming",
        "description" : "Integrating multiple APIs of different sorts (ie: Web facing RESTful, internal library, data storage, low level event logging, etc) into a single application, the complexity of the manifold interactions can very quickly become an obstacle to agility. In this session, engineers from Versal will discuss how their move to a functional programming model allowed them to migrate from an event-sourced architecture and in-memory hierarchical data model to an on-disk relational data model that allowed them to greatly simplify their application development process. Examples of how to apply functional programming concepts to various API designs will be provided. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Kelley Robinson, James Earl Douglas"
    },
    {
        "id" : 501,
        "name" : "Keynote Panel: The API Copyright Emergency: What's Next?",
        "description" : "The recent decision by the US Appellate Court in the case of Oracle v. Google that APIs can be copyrighted has sent shockwaves through not just the API Economy, but the entire technology industry. The decision has resulted in widespread confusion about what the decision means, especially when it comes to API fair use; a nuanced part of the ruling that was remanded back to the Circuit Court for further deliberation. For this panel discussion that we've scrambled together at the last minute, we've pulled together some of the leading experts on the matter to debate the efficacy of the decision, to help us understand what will or could happen next, and what action we should be taking (or not taking) now.",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Lawrence Rosen, Pamela Samuelson, Annette Hurst, Mike Linksvayer"
    },
    {
        "id" : 511,
        "name" : "Tips To Rock At Hackathons",
        "description" : "Do you love hackathons? If so, you probably know that one of the most precious resources at a hackathon is time. In this workshop, we'll walk you through some useful tips and tricks to save time when implementing third-party APIs. Specifically, we'll show you how to authenticate an app with no hassle, and how to override the CORS problem - always present when working on apps with no backend- amongst other useful tips. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Nicolas Greni', Vanessa Ramos"
    },
    {
        "id" : 521,
        "name" : "Imagery as a Conversion Multiplier in your Product",
        "description" : "Every picture tells a story. We have over 90 million of them. How do you find the right one? How can you automate that selection process? Where can I get the latest Wil Wheaton photos? Learn how to how to utilize Getty Images stills and videos through powerful search and metadata to integrate quality description into your projects. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Bryan Van Dyk, Matt Dahlgren, Niko Kirov, James Speaker, "
    },
    {
        "id" : 531,
        "name" : "Solve Real-World Problems with SMS",
        "description" : "Reaching over 4 billion people globally with a 95% open rate - SMS is a great channel for effective and responsive communication worldwide. In this workshop, explore how SMS solutions solve real-world problems like 2nd factor authentication, proxied chats, instant feedback and more. Every day SMS is used to provide 2nd factor authentication to sites and services around the world. In a similar way it's used by mobile apps and signup flows to confirm that a user is providing their real number. Learn what you need to know before building this kind of system, what you should avoid, and take a look at a simple 2FA solution built on Nexmo. Private message systems and an inbox on your app do the job - just not as effectively as just letting your users text each other. But how do you do that while protecting their privacy? Find out how to proxy SMS conversations, letting your users use the communication channel they're already familiar with, and join an Nexmo powered sms-roulette. Collecting feedback is important. Whether your customers are online, or in a brick and mortar store, asking for feedback via SMS makes it an easy and simple process. No survey codes, no URLs to type. See how to collect feedback from your customers, wherever they are. And, obviously, you'll get to provide some feedback on this workshop. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Tim Lytle"
    },
    {
        "id" : 541,
        "name" : "How to build apps for the \"un-apped\" business travel market using Concur APIs",
        "description" : "To prepare you for the hackathon, this session will cover what Concur is, the data exposed by the Concur APIs, how to get started in 5-mins, ideas for apps to build (including cool ideas from previous hackathons), and how to get access to a Concur developer account pre-loaded with data. Business travel is a $1T (that's trillion) industry. Our goal in this session is to set you on the path to getting a piece of the business travel action.",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Christian Ismael "
    },
    {
        "id" : 551,
        "name" : "Digital Identity: Moving away from passwords to a better world",
        "description" : "For more than 25 years, we have relied on ID/passwords as the main method to onboard new users on the web or via mobile apps. This approach has presented friction that social login, and other solutions have partially solved. In addition, as your online services or mobile apps increase in popularity, passwords start to become a liability. Overall a different approach is needed with respect to authentication and usability. Anchoring digital IDs in devices that users possess should be a key focus to truly enable online and mobile services. Now is the time to explore new solutions that solve a number of issues that passwords present such as scalability, usability and security issues. In this workshop, we will explore some of the traditional ways to secure online access. Then we will look at a more innovative approach via device anchoring and dynamic authentication that will let you strongly and uniquely identify your customers with a unified solution across mobile (iOS and Android) and desktop from your own trusted devices. We will take a deeper look at SecureKey's briidge.net Connect Mobile and Web SDK and you will learn hands on how to anchor digital IDs in trusted devices and make every authentication event a unique proof of your customer's identity, while simplifying access with a better user experience. As a sponsor of the Hackathon, we will also spend time presenting some of the use cases that this approach is particularly tailored to and familiarize you with the APIs and sample code. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Florin Birsan, David Stark"
    },
    {
        "id" : 561,
        "name" : "The Connected Car by Mojio",
        "description" : "The workshop will be an introduction of the Mojio API and an overview of our vision for the connected car. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Narayan Sainaney"
    },
    {
        "id" : 571,
        "name" : "Building Siri-like voice interfaces",
        "description" : "For us developers, speech interfaces often mean frustration and bad user experience. However, by leveraging recent APIs, it's now possible to add a natural language interface to an app or device in minutes. Not all apps are good candidates to receive a voice UI though, and we'll see what makes a bad or good user experience. Finally, we'll actually build a Siri-like app that you can talk to! The workshop will be of interest to developers and product designers in mobile, wearables and IoT in particular. ",
        "starts_at" : null,
        "ends_at" : null,
        "organizers" : "Alex Lebrun"
    }
]